In [1]:
import numpy as np
import pandas as pd

In [2]:
# DataFrame

In [3]:
# 2D row and column
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [4]:
pd.DataFrame()
Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'

SyntaxError: invalid syntax (1127668663.py, line 2)

In [ ]:
pd.DataFrame().dtypes

In [ ]:
l = [12,34,56,67,90]
pd.DataFrame(l)

In [ ]:
pd.DataFrame([1,2.,3,4]) # Implicit typecasting

In [ ]:
pd.DataFrame([1,2.,3,4],dtype='int') # Explicit Typcasting

In [ ]:
d = pd.DataFrame([1,2.,3,4],dtype='int')
d.dtypes

In [ ]:
a = pd.DataFrame(['1','2','3'])
a

In [ ]:
a.dtypes

In [ ]:
a2 = a.astype('int')
a2

In [ ]:
a2.dtypes

In [ ]:
# Advantage is we can create a data frame with Diff Data types

In [ ]:
df1 = {'name':['A','B','C'],'age':[23,45,34],'salary':[25000,50000,40000]}

In [ ]:
h = pd.DataFrame(df1)
h

In [ ]:
h.dtypes

# We can create a data frame using a

list
series
numpy
range
str
dict

In [ ]:
pd.DataFrame([10,20,30])

In [ ]:
# list of list : one list is one row
pd.DataFrame([[10,20,30],[11,22,33]])

In [ ]:
# using by series
pd.DataFrame(pd.Series([101,201,301,401,501]))

In [7]:
# using numpy
data1 = np.random.random((4,4))
data1

array([[0.44501492, 0.36088685, 0.83321607, 0.85896209],
       [0.27771176, 0.49303162, 0.95600168, 0.95550938],
       [0.39629032, 0.78979907, 0.99447805, 0.0947769 ],
       [0.48838616, 0.11403678, 0.37575498, 0.06745348]])

In [ ]:
data1.ndim

In [8]:
pd.DataFrame(data1)

          0         1         2         3
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [5]:
pd.DataFrame(np.random.random((4,4)))

          0         1         2         3
0  0.344211  0.073034  0.260303  0.791290
1  0.112382  0.662403  0.327027  0.222722
2  0.875768  0.649520  0.235400  0.443349
3  0.268868  0.467881  0.172187  0.530487

In [9]:
# Customize column labels
d2 = pd.DataFrame(data1,columns=['col1','col2','col3','col4'])
d2

       col1      col2      col3      col4
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [10]:
# check column names
d2.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [11]:
# Change all column names/replace column names with new one
d2.columns = ['A1','B1','C1','D1']

In [12]:
d2

         A1        B1        C1        D1
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [ ]:
# Replace a name of single column
d2.rename(columns={'A1':'ABC'})

In [13]:
d2.describe()

             A1        B1        C1        D1
count  4.000000  4.000000  4.000000  4.000000
mean   0.401851  0.439439  0.789863  0.494175
std    0.090908  0.281473  0.284508  0.478717
min    0.277712  0.114037  0.375755  0.067453
25%    0.366646  0.299174  0.718851  0.087946
50%    0.420653  0.426959  0.894609  0.476869
75%    0.455858  0.567223  0.965621  0.883099
max    0.488386  0.789799  0.994478  0.955509

In [14]:
# Transpose
d2.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
A1,4.0,0.401851,0.090908,0.277712,0.366646,0.420653,0.455858,0.488386
B1,4.0,0.439439,0.281473,0.114037,0.299174,0.426959,0.567223,0.789799
C1,4.0,0.789863,0.284508,0.375755,0.718851,0.894609,0.965621,0.994478
D1,4.0,0.494175,0.478717,0.067453,0.087946,0.476869,0.883099,0.955509

In [17]:
# i want answer of each factor seprtely
# consider A1 column
d2.A1

0    0.445015
1    0.277712
2    0.396290
3    0.488386
Name: A1, dtype: float64

In [18]:
d2.A1.count()

4

In [19]:
len(d2.A1)

4

In [20]:
type(d2.A1)

pandas.core.series.Series

In [22]:
# calculate mean 
d2.A1.mean()

0.40185079101774446

In [23]:
d2

         A1        B1        C1        D1
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [24]:
d2.mean()
# calculate the mean column wise

A1    0.401851
B1    0.439439
C1    0.789863
D1    0.494175
dtype: float64

In [25]:
# calculate mean row wise
d2.mean(axis=1)

0    0.624520
1    0.670564
2    0.568836
3    0.261408
dtype: float64

In [26]:
d2['B1']

0    0.360887
1    0.493032
2    0.789799
3    0.114037
Name: B1, dtype: float64

In [27]:
# cal std of all column
d2.std()

A1    0.090908
B1    0.281473
C1    0.284508
D1    0.478717
dtype: float64

In [28]:
d2.A1.std()

0.09090825360328034

In [29]:
d2.std().std() # all columns std

0.158330490145878

In [31]:
d2.values.flatten().std() # std of all data

0.31290292301121536

In [32]:
d2.values.flatten() # convert data in 1D

array([0.44501492, 0.36088685, 0.83321607, 0.85896209, 0.27771176,
       0.49303162, 0.95600168, 0.95550938, 0.39629032, 0.78979907,
       0.99447805, 0.0947769 , 0.48838616, 0.11403678, 0.37575498,
       0.06745348])

In [33]:
d2.A1.mean()

0.40185079101774446

# Selection of columns

In [34]:
d2.A1 # 1D Data

0    0.445015
1    0.277712
2    0.396290
3    0.488386
Name: A1, dtype: float64

In [35]:
d2['A1'] # !D data

0    0.445015
1    0.277712
2    0.396290
3    0.488386
Name: A1, dtype: float64

In [36]:
# 2D data
d2[['A1']]

         A1
0  0.445015
1  0.277712
2  0.396290
3  0.488386

In [37]:
# access more than one column
d2[['A1','B1','C1']]

         A1        B1        C1
0  0.445015  0.360887  0.833216
1  0.277712  0.493032  0.956002
2  0.396290  0.789799  0.994478
3  0.488386  0.114037  0.375755

loc : location based selection / label based selection

In [38]:
d2.loc[:,:]  #[rows, columns]

         A1        B1        C1        D1
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [39]:
# work on column
d2.loc[:,'C1':]

         C1        D1
0  0.833216  0.858962
1  0.956002  0.955509
2  0.994478  0.094777
3  0.375755  0.067453

In [41]:
d2.loc[:1,'A1':'B1'] # stop is inclusive

         A1        B1
0  0.445015  0.360887
1  0.277712  0.493032

In [43]:
# reverse the column order
d2.loc[:,::-1]

         D1        C1        B1        A1
0  0.858962  0.833216  0.360887  0.445015
1  0.955509  0.956002  0.493032  0.277712
2  0.094777  0.994478  0.789799  0.396290
3  0.067453  0.375755  0.114037  0.488386

In [44]:
# Assignment Apply different options over rows using loc

In [45]:
# access data using by indexing
d2.iloc[:,:]

         A1        B1        C1        D1
0  0.445015  0.360887  0.833216  0.858962
1  0.277712  0.493032  0.956002  0.955509
2  0.396290  0.789799  0.994478  0.094777
3  0.488386  0.114037  0.375755  0.067453

In [49]:
d2.iloc[:2,0:2] # stop is exclusive in iloc

         A1        B1
0  0.445015  0.360887
1  0.277712  0.493032

In [50]:
# Groupby
'''
A group by operation involves some combination of splitting the object,
applying a function, and combining the results.

This can be used to group large amounts of data and compute operations on these data
'''

'\nA group by operation involves some combination of splitting the object,\napplying a function, and combining the results.\n\nThis can be used to group large amounts of data and compute operations on these data\n'

In [56]:
ipl_data = {'Team':['MI','DL','MI','DL','Kings','CSK','CSK','CSK','MI','RR','RR','MI'],
           'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
           'Year':[2014,2015,2014,2015,2016,2015,2016,2017,2016,2014,2015,2017],
           'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [57]:
df = pd.DataFrame(ipl_data)
df

     Team  Rank  Year  Points
0      MI     1  2014     876
1      DL     2  2015     789
2      MI     2  2014     863
3      DL     3  2015     673
4   Kings     3  2016     741
5     CSK     4  2015     812
6     CSK     1  2016     756
7     CSK     1  2017     788
8      MI     2  2016     694
9      RR     4  2014     701
10     RR     1  2015     804
11     MI     2  2017     690

In [58]:
df.Team

0        MI
1        DL
2        MI
3        DL
4     Kings
5       CSK
6       CSK
7       CSK
8        MI
9        RR
10       RR
11       MI
Name: Team, dtype: object

In [59]:
df['Team']

0        MI
1        DL
2        MI
3        DL
4     Kings
5       CSK
6       CSK
7       CSK
8        MI
9        RR
10       RR
11       MI
Name: Team, dtype: object

In [60]:
# access Team and Rank 
df.drop(columns=['Year','Points'])

     Team  Rank
0      MI     1
1      DL     2
2      MI     2
3      DL     3
4   Kings     3
5     CSK     4
6     CSK     1
7     CSK     1
8      MI     2
9      RR     4
10     RR     1
11     MI     2

In [61]:
# i want unique Teanm names / find out total teams in dataset
df['Team'].unique()

array(['MI', 'DL', 'Kings', 'CSK', 'RR'], dtype=object)

In [62]:
df['Team'].unique().size

5

In [63]:
# find out total count teamwise
df['Team'].value_counts()
# default order Descending

MI       4
CSK      3
DL       2
RR       2
Kings    1
Name: Team, dtype: int64

In [64]:
# find out total count teamwise
df['Team'].value_counts(ascending=True)
# default order Ascending

Kings    1
DL       2
RR       2
CSK      3
MI       4
Name: Team, dtype: int64

In [65]:
df

     Team  Rank  Year  Points
0      MI     1  2014     876
1      DL     2  2015     789
2      MI     2  2014     863
3      DL     3  2015     673
4   Kings     3  2016     741
5     CSK     4  2015     812
6     CSK     1  2016     756
7     CSK     1  2017     788
8      MI     2  2016     694
9      RR     4  2014     701
10     RR     1  2015     804
11     MI     2  2017     690

In [66]:
df.dtypes

Team      object
Rank       int64
Year       int64
Points     int64
dtype: object

In [67]:
# Group DataFrame using a mapper or by a series of columns.
df.groupby('Team')
#groupby on Team column

In [68]:
# typecast above: to get a output
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('DL',
    Team  Rank  Year  Points
  1   DL     2  2015     789
  3   DL     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2016     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  2    MI     2  2014     863
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('RR',
     Team  Rank  Year  Points
  9    RR     4  2014     701
  10   RR     1  2015     804)]

In [70]:
tm = df.groupby('Team')
tm

In [71]:
for i in tm:
    print(i, end='\n\n')

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)

('DL',   Team  Rank  Year  Points
1   DL     2  2015     789
3   DL     3  2015     673)

('Kings',     Team  Rank  Year  Points
4  Kings     3  2016     741)

('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
2    MI     2  2014     863
8    MI     2  2016     694
11   MI     2  2017     690)

('RR',    Team  Rank  Year  Points
9    RR     4  2014     701
10   RR     1  2015     804)

In [ ]:
for i in tm:
    print(i[, end='\n\n')